#Розберемо просту техніку кодування та декодування на основі серій.
#Наприклад, у нас є список із повторюваними спостереженнями якоїсь величини, вона може приймати значення X, Y або Z.
#Значення з'являються у довільному порядку та зберігаємо ми їх у списку ["X", "X", "X", "Z", "Z", "X", "X", "Y", "Y", "Y", "Z", "Z"] або рядку "XXXZZXXYYYZZ".
#Внаслідок чого ми можемо зменшити обсяг інформації, що зберігається?
#Стиснення можна досягти заміною групи повторюваних значень на одноразове значення та лічильник повторів: ["X", 3, "Z", 2, "X", 2, "Y", 3, "Z", 2]
#Напишіть рекурсивну функцію decode для декодування списку, закодованого цим способом.
#Як аргумент функція приймає закодований список. Функція має повернути розшифрований список елементів.

def decode(data):
    res = list()
    if not data :
        return []
    for i in range(data[1]) :
        res.append(data[0])
    data = data[2:]
    result = res
    result.extend(decode(data))
    
    return result
print(decode(["X", 3, "Z", 2, "X", 2, "Y", 3, "Z", 2]))